{
  "backend/main.mo": "Empty Motoko actor with no methods.",
  "feature_evidence.json": "Feature report listing two frontend tasks about removing pig plushie images and asset references.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries of various frontend components and config files.",
  "frontend/index.css": "Tailwind base styles defining theme variables for light/dark modes with Valentine‑themed colors.",
  "frontend/index.html": "Basic HTML shell loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Main React component managing question/yes/no view state within a themed layout.",
  "frontend/src/components/valentine/CelebrationHearts.tsx": "Generates floating animated heart icons for the yes‑state celebration.",
  "frontend/src/components/valentine/PersonalizationPanel.tsx": "Empty component file with no implementation.",
  "frontend/src/components/valentine/ValentineLayout.tsx": "Layout wrapper providing a background image, gradient, and overlay for Valentine UI pages.",
  "frontend/src/components/valentine/ValentineNoState.tsx": "Displays the 'No' response card with gentle messaging and a button to return.",
  "frontend/src/components/valentine/ValentineQuestionCard.tsx": "Main question card with decorative images, message text, and Yes/Maybe buttons.",
  "frontend/src/components/valentine/ValentineYesState.tsx": "'Yes' celebration card with animated hearts and a back button.",
  "frontend/src/hooks/useActor.ts": "React hook creating and updating an authenticated or anonymous backend actor using React Query.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity login state using AuthClient, exposing identity, login, logout, and status flags.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file indicating no backend queries are used and all state is client‑side.",
  "frontend/src/index.css": "Defines Tailwind base styles, Valentine-themed color variables, fonts, focus styles, and custom heart animations.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and the Internet Identity provider.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions including typography, colors tied to CSS variables, animations, and dark mode settings.",
  "project_state.json": "Stores project metadata, existing features, requirements links, and architectural notes for the Valentine’s Day site."
}