{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Remove pig plushie decorations from Valentine question card",
  "requirements": [
    {
      "id": "REQ-18",
      "summary": "Remove the five absolutely-positioned pig plushie <img> elements from the ValentineQuestionCard so no pig imagery appears on the question screen.",
      "acceptanceCriteria": [
        "In the Question view, no pig plushie images are rendered (no elements referencing /assets/generated/pig-plushie-*.png).",
        "The rest of the ValentineQuestionCard layout remains functional and visually intact (seal, heart bouquet, message text, and Yes/No buttons still render and work).",
        "No console errors are introduced by the removal of the pig images."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/valentine/ValentineQuestionCard.tsx",
          "operation": "modify",
          "description": "Delete the five decorative, absolutely-positioned pig plushie <img> elements near the top of the card (all pig-plushie-*.dim_256x256.png references) while keeping the surrounding CardContent structure intact so the seal, bouquet, message, and buttons continue to render and function."
        }
      ]
    },
    {
      "id": "REQ-19",
      "summary": "Remove all remaining frontend code references to pig plushie static image assets so the app no longer attempts to load them.",
      "acceptanceCriteria": [
        "A project-wide search shows zero references to the pig plushie filenames in frontend source files after the change.",
        "The app builds and runs without attempting to load any pig plushie images."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/valentine/ValentineQuestionCard.tsx",
          "operation": "modify",
          "description": "Ensure there are zero remaining references to pig plushie assets in this component (including: /assets/generated/pig-plushie-bunny.dim_256x256.png, /assets/generated/pig-plushie-angel.dim_256x256.png, /assets/generated/pig-plushie-stack.dim_256x256.png, /assets/generated/pig-plushie-blanket.dim_256x256.png, /assets/generated/pig-plushie-external-1.dim_256x256.png)."
        }
      ]
    }
  ]
}